// 의사코드

// 1. 배열에서 두번째 요소를 선택하여 시작 (첫번째는 정렬 됬다고 가정하기 때문)
// 2. 두번째 값을 취해서 앞에 있는 값과 비교해서 필요하다면 바꿔준다.
// 3. 다음 옆의 요소로 계속해서 올바른 위치에 있는지 확인

// 시간 복잡도

function InsertionSort(arr) {
  for (let i = 1; i < arr.length; i++) {
    // console.log(i);
    let temp = 0;
    let currentVal = arr[i];

    for (let j = i - 1; j >= 0 && arr[j] > currentVal; j--) {
      //   console.log(i, j, arr[j], arr[j + 1], currentVal);

      arr[j + 1] = arr[j];
      temp = j + 1;
    }

    if (temp !== 0) {
      arr[temp - 1] = currentVal;
    }

    // console.log(arr);
  }

  return arr;
}

console.log(InsertionSort([2, 1, 9, 76, 4, 2, -2, 0]));
// [-2, 0, 1, 2, 2, 4, 9, 76];

// 1
// 1 0 2 1
// [  1, 2,  9, 76,  4, 2, -2,  0]

// 2
// [  1, 2,  9, 76,  4, 2, -2,  0]

// 3
// [  1, 2,  9, 76,  4, 2, -2,  0]

// 4
// 4 3 76 4
// 4 2 9 4
// [   1, 2,  4, 9,  76, 2, -2, 0 ]

// 5
// 5 4 76 2
// 5 3 9 2
// 5 2 4 2
// [  1,  2,  2, 4,  9, 76, -2, 0]

// 6
// 6 5 76 -2
// 6 4 9 -2
// 6 3 4 -2
// 6 2 2 -2
// 6 1 2 -2
// 6 0 1 -2
// [  -2, 1,  2, 2,   4, 9, 76, 0]

// 7
// 7 6 76 0
// 7 5 9 0
// 7 4 4 0
// 7 3 2 0
// 7 2 2 0
// 7 1 1 0
// [  -2, 0, 1,  2,   2, 4, 9, 76]
// [  -2, 0, 1,  2,   2, 4, 9, 76]
